;Комментарий
;*-путь к программе
;------------------------
;Создание меню
;------------------------
LoadMenus(*menu/menus.xml);
;------------------------
;Создание пустого чертежа
;------------------------
;NewDWG

;------------------------
;Загрузка ткстовых файлов
;------------------------
;Load(*sample/test_dxf/teapot.dxf)
;Load(*sample/test_dxf/em.dxf)
;Load(*autosave/autosave.dxf)
;Load(*sample/zigzag.dxf)

;-----------------------------------
;Показ окна "О программе" при старте
;-----------------------------------
About
