unit DEVICE_EL_VL_QUESTIONNAIRE1;

interface

uses system,devices;
usescopy blocktype;
usescopy objname;

var

T1:String;(*'Заказчик'*)
T2:String;(*'Данные 1'*)
T3:String;(*'Данные 2'*)
T4:String;(*'Данные 3'*)
T5:String;(*'Количество ТМ'*)
T6:String;(*'Мощность ТМ'*)
T7:String;(*'Напряжение'*)
T8:String;(*'Номиналбный ток'*)
T9:String;(*'Группа соедиенеий'*)
T10:String;(*'Поставка ТМ'*)
T11:String;(*'Тип ввода'*)
T12:String;(*'Тип вывода'*)
T13:String;(*'Поставка РЛНД'*)
T14:String;(*'Компановка'*)
T15:String;(*'Однолин. схема'*)
T16:String;(*'Поставка цоколя'*)
T17:String;(*'Высота цоколя'*)
T18:String;(*'Площадка ТМ'*)
T19:String;(*'Площадка РУВН/РУНН'*)
T20:String;(*'Поставка маслопримеников'*)
T21:String;(*'Система водослива'*)
T22:String;(*'Уличное освещение'*)
T23:String;(*'Пожарная сигнализация'*)
T24:String;(*'Вид исполнения'*)
T25:String;(*'Вентиляция трансф.отсека'*)
T26:String;(*'Вентиляция РУВН'*)
T27:String;(*'Вентиляция РУНН'*)
T28:String;(*'Цвет крыши'*)
T29:String;(*'Цвет стен'*)
T30:String;(*'Цвет дверей, ворот'*)
T31:String;(*'Цвет цоколя'*)
T32:String;(*'Доп. требования'*)

implementation

begin

BTY_TreeCoord:='PLAN_EM_Опросник';
Device_Type:=TDT_SilaPotr;
Device_Class:=TDC_Shell;

NMO_Name:='ОП0';
NMO_BaseName:='ОП';
NMO_Suffix:='??';

T1:='';
T2:='';
T3:='';
T4:='';
T5:='2';
T6:='6/10';
T7:='1000';
T8:='ТМГ';
T9:='Y/Yн-0 Д/Yн-11';
T10:='Да';
T11:='Кабельный';
T12:='Кабельный';
T13:='Нет';
T14:='В приложении';
T15:='В приложении';
T16:='Да';
T17:='1200';
T18:='Да';
T19:='Да';
T20:='Да';
T21:='Да';
T22:='Да';
T23:='Да';
T24:='Утепленный';
T25:='Принудительная';
T26:='Принудительная';
T27:='Принудительная';
T28:='RAL 5005 синий';
T29:='RAL 9003 Белый';
T30:='RAL 5005 синий';
T31:='RAL 5005 синий';
T32:='';

end.