subunit devicebase;
interface
uses system;
type
     TMANOTOM_TM2030CG_1LIMIT=(_minus50_50(*'-50..50'*),
                         _minus50_100(*'-50..100'*),
                         _minus50_150(*'-50..150'*),
                         _0_150(*'0..150'*),
                         _0_160(*'0..160'*),
                         _0_200(*'0..200'*),
                         _0_300(*'0..300'*),
                         _0_400(*'0..400'*),
                         _100_300(*'100..300'*),
                         _100_500(*'100..500'*),
                         _200_500(*'200..500'*));
     TMANOTOM_TM2030CG_1ISP=(_III(*'III(р+р)'*),
                         _IV(*'IV(з+з)'*),
                         _V(*'V(р+з)(базовое)'*),
                         _VI(*'VI(з+р)'*));
     TMANOTOM_TM2030CG_1LKAP=(_10k(*'1'*),
                         _160k(*'1.6'*),
                         _250k(*'2.5'*),
                         _400k(*'4'*),
                         _600k(*'6'*),
                         _100k(*'10'*));
     TMANOTOM_TM2030CG_1L=(_160(*'160'*),
                         _200(*'200'*),
                         _250(*'250'*),
                         _315(*'315'*),
                         _400(*'400'*),
                         _500(*'500'*));
     TMANOTOM_TM2030CG_1=packed object(ElDeviceBaseObject);
                          Limit:TMANOTOM_TM2030CG_1LIMIT;
                          Isp:TMANOTOM_TM2030CG_1ISP;
                          LKap:TMANOTOM_TM2030CG_1LKAP;
                          L:TMANOTOM_TM2030CG_1L;
     end;

var
   _EQ_MANOTOM_TM2030CG_1:TMANOTOM_TM2030CG_1;
implementation
begin
   _EQ_MANOTOM_TM2030CG_1.initnul;
   _EQ_MANOTOM_TM2030CG_1.Limit:=_0_150;
   _EQ_MANOTOM_TM2030CG_1.Isp:=_V;
   _EQ_MANOTOM_TM2030CG_1.LKap:=_600k;
   _EQ_MANOTOM_TM2030CG_1.L:=_160;

   _EQ_MANOTOM_TM2030CG_1.Group:=_thermoswitches;
   _EQ_MANOTOM_TM2030CG_1.EdIzm:=_sht;
   _EQ_MANOTOM_TM2030CG_1.ID:='MANOTOM_TM2030CG_1';
   _EQ_MANOTOM_TM2030CG_1.Standard:='ТУ 4211-030-00225590-99';
   _EQ_MANOTOM_TM2030CG_1.OKP:='';
   _EQ_MANOTOM_TM2030CG_1.Manufacturer:='ОАО «Манотомь» г.Томск';
   _EQ_MANOTOM_TM2030CG_1.Description:='Термометры манометрические показывающие сигнализирующие ТМ2030Сг-1 (с газовым заполнителем) и ТМ2030Сг-2 (с конденсационным заполнителем) предназначены для непрерывного измерения температуры жидкостей и газов, нейтральных в отношении их воздействия на сталь и медные сплавы, и управления внешними электрическими цепями от сигнализирующего устройства. Применяются в различных установках и в системах теплоэнергетического контроля, где необходима своевременная информация о достигнутых крайних значениях температуры.';
   _EQ_MANOTOM_TM2030CG_1.NameShortTemplate:='ТМ2030Сг-1-У2-%%[Limit]°C-2.5-IP53-%%[Isp]-%%[LKap]м-%%[L]мм';
   _EQ_MANOTOM_TM2030CG_1.NameTemplate:='Термометр манометрический электроконтактный, предел измерений %%[Limit]°C, IP53, контактное устройство %%[Isp], капиляр %%[LKap]м, погружная часть %%[L]мм';
   _EQ_MANOTOM_TM2030CG_1.NameFullTemplate:='Термометр манометрический электроконтактный, климатическое исполнение У2, предел измерений %%[Limit]°C, класс точности 2.5, IP53, исполнение контактного устройства %%[Isp], длина капиляра %%[LKap]м, длина погружной части %%[L]мм';
   _EQ_MANOTOM_TM2030CG_1.UIDTemplate:='TM2030CG_1-U2-%%[Limit]-2.5-IP53-%%[Isp]-%%[LKap]-%%[L]';
   _EQ_MANOTOM_TM2030CG_1.TreeCoord:='BP_Манотомь_Термометры сигнализирующие_ТМ2030Сг-1|BC_Оборудование автоматизации_Термометры сигнализирующие_ТМ2030Сг-1';
   _EQ_MANOTOM_TM2030CG_1.format;
end.