subunit devicebase;
interface
uses system;
type
     TSARCABLETPPep_WCS=(_0010_2_040(*'10х2х0.4'*),
                         _0020_2_040(*'20х2х0.4'*),
                         _0030_2_040(*'30х2х0.4'*),
                         _0050_2_040(*'50х2х0.4'*),
                         _0100_2_040(*'100х2х0.4'*),
                         _0200_2_040(*'200х2х0.4'*),
                         _0300_2_040(*'300х2х0.4'*),
                         _0400_2_040(*'400х2х0.4'*),
                         _0500_2_040(*'500х2х0.4'*),
                         _0600_2_040(*'600х2х0.4'*),
                         _0700_2_040(*'700х2х0.4'*),
                         _0800_2_040(*'800х2х0.4'*),
                         _0900_2_040(*'900х2х0.4'*),
                         _1000_2_040(*'1000х2х0.4'*),
                         _1200_2_040(*'1200х2х0.4'*),
                         _0005_2_050(*'5х2х0.5'*),
                         _0010_2_050(*'10х2х0.5'*),
                         _0020_2_050(*'20х2х0.5'*),
                         _0030_2_050(*'30х2х0.5'*),
                         _0050_2_050(*'50х2х0.5'*),
                         _0100_2_050(*'100х2х0.5'*),
                         _0150_2_050(*'150х2х0.5'*),
                         _0200_2_050(*'200х2х0.5'*),
                         _0300_2_050(*'300х2х0.5'*),
                         _0500_2_050(*'400х2х0.5'*),
                         _0500_2_050(*'500х2х0.5'*),
                         _0600_2_050(*'600х2х0.5'*),
                         _0700_2_050(*'700х2х0.5'*),
                         _0800_2_050(*'800х2х0.5'*),
                         _0900_2_050(*'900х2х0.5'*),
                         _1000_2_050(*'1000х2х0.5'*),
                         _1200_2_050(*'1200х2х0.5'*),
                         _0010_2_064(*'10х2х0.64'*),
                         _0020_2_064(*'20х2х0.64'*),
                         _0030_2_064(*'30х2х0.64'*),
                         _0064_2_064(*'50х2х0.64'*),
                         _0100_2_064(*'100х2х0.64'*),
                         _0150_2_064(*'150х2х0.64'*),
                         _0200_2_064(*'200х2х0.64'*),
                         _0300_2_064(*'300х2х0.64'*));
    TSARCABLETPPep=object(CableDeviceBaseObject)
                        Wire_Count_Section_DESC:TSARCABLETPPep_WCS;
           end;
var
   _EQ_SARCABLETPPep:TSARCABLETPPep;
implementation
begin

     _EQ_SARCABLETPPep.initnul;

     _EQ_SARCABLETPPep.Category:=_kables;
     _EQ_SARCABLETPPep.Group:=_cables_sv;
     _EQ_SARCABLETPPep.EdIzm:=_m;
     _EQ_SARCABLETPPep.ID:='SARCABLETPPep';
     _EQ_SARCABLETPPep.Standard:='ГОСТ Р 51311-99';
     _EQ_SARCABLETPPep.OKP:='35 7200';
     _EQ_SARCABLETPPep.Manufacturer:='ОАО "Завод Сарансккабель" г.Саранск';
     _EQ_SARCABLETPPep.Description:='Кабели предназначены для монтажа низкочастотного оборудования телефонных станций при постоянном напряжении до 120 В и эксплуатации при температуре окружающей среды от -10 C° до +50 С° и относительной влажности до 80%.';

     _EQ_SARCABLETPPep.NameShortTemplate:='ТППэп-%%[Wire_Count_Section_DESC]';
     _EQ_SARCABLETPPep.NameTemplate:='Кабель телефонный ТППэп-%%[Wire_Count_Section_DESC]';
     _EQ_SARCABLETPPep.UIDTemplate:='%%[ID]-%%[Wire_Count_Section_DESC]';
     _EQ_SARCABLETPPep.NameFullTemplate:='Кабель телефонный с полиэтиленовой изоляцией в пластмассовой изоляции, сечением %%[Wire_Count_Section_DESC]';

     _EQ_SARCABLETPPep.Wire_Count_Section_DESC:=_0020_2_050;

     _EQ_SARCABLETPPep.TreeCoord:='BP_САРАНСККАБЕЛЬ_Кабели связи_ТППэп|BC_Кабельная продукция_Связи_ТППэп(САРАНСККАБЕЛЬ)';

     _EQ_SARCABLETPPep.format;
end.