subunit devicebase;
interface
uses system;
type
     TSEVCABLE_VVGNGAFRLS_WCS=(_01_01_50(*'1х1.5'*),
                        _01_02_50(*'1х2.5'*),
                        _01_04_00(*'1х4'*),
                        _01_06_00(*'1х6'*),
                        _01_10_00(*'1х10'*),
                        _01_16_00(*'1х16'*),
                        _01_25_00(*'1х25'*),
                        _01_35_00(*'1х35'*),
                        _01_50_00(*'1х50'*),
                        _01_70_00(*'1х70'*),
                        _01_95_00(*'1х95'*),
                        _01_120_00(*'1х120'*),
                        _01_150_00(*'1х150'*),
                        _01_185_00(*'1х185'*),
                        _01_240_00(*'1х240'*),
                        _01_300_00(*'1х300'*),
                        _01_400_00(*'1х400'*),
                        _01_500_00(*'1х500'*),
                        _01_630_00(*'1х630'*),
                        _01_800_00(*'1х800'*),
                        _01_1000_00(*'1х1000'*), 
                        _02_01_50(*'2х1.5'*),
                        _02_02_50(*'2х2.5'*),
                        _02_04_00(*'2х4'*),
                        _02_06_00(*'2х6'*),
                        _02_10_00(*'2х10'*),
                        _02_16_00(*'2х16'*),
                        _02_25_00(*'2х25'*),
                        _02_35_00(*'2х35'*),
                        _02_50_00(*'2х50'*),
                        _02_70_00(*'2х70'*),
                        _02_95_00(*'2х95'*),
                        _02_120_00(*'2х120'*),
                        _02_150_00(*'2х150'*),
                        _02_185_00(*'2х185'*),
                        _02_240_00(*'2х240'*),
                        _03_01_50(*'3х1.5'*),
                        _03_02_50(*'3х2.5'*),
                        _03_04_00(*'3х4'*),
                        _03_06_00(*'3х6'*),
                        _03_10_00(*'3х10'*),
                        _03_16_00(*'3х16'*),
                        _03_25_00(*'3х25'*),
                        _03_35_00(*'3х35'*),
                        _03_50_00(*'3х50'*),
                        _03_70_00(*'3х70'*),
                        _03_95_00(*'3х95'*),
                        _03_120_00(*'3х120'*),
                        _03_150_00(*'3х150'*),
                        _03_185_00(*'3х185'*),
                        _03_240_00(*'3х240'*),
                        _03_300_00(*'3х300'*),
                        _03_400_00(*'3х400'*),
                        _04_01_50(*'4х1.5'*),
                        _04_02_50(*'4х2.5'*),
                        _04_04_00(*'4х4'*),
                        _04_06_00(*'4х6'*),
                        _04_10_00(*'4х10'*),
                        _04_16_00(*'4х16'*),
                        _04_25_00(*'4х25'*),
                        _04_35_00(*'4х35'*),
                        _04_50_00(*'4х50'*),
                        _04_70_00(*'4х70'*),
                        _04_95_00(*'4х95'*),
                        _04_120_00(*'4х120'*),
                        _04_150_00(*'4х150'*),
                        _04_185_00(*'4х185'*),
                        _04_240_00(*'4х240'*),
                        _04_300_00(*'4х300'*),
                        _04_400_00(*'4х400'*),
                        _05_01_50(*'5х1.5'*),
                        _05_02_50(*'5х2.5'*),
                        _05_04_00(*'5х4'*),
                        _05_06_00(*'5х6'*),
                        _05_10_00(*'5х10'*),
                        _05_16_00(*'5х16'*),
                        _05_25_00(*'5х25'*),
                        _05_70_00(*'5х70'*),
                        _05_95_00(*'5х95'*),
                        _05_120_00(*'5х120'*),
                        _05_150_00(*'5х150'*),
                        _05_185_00(*'5х185'*),
                        _05_240_00(*'5х240'*));
    tSEVCABLEVVGNGAFRLS=packed object(CableDeviceBaseObject)
                        Wire_Count_Section_DESC:TSEVCABLE_VVGNGAFRLS_WCS;
           end;
var
   _EQ_SEVCABLEVVGNGAFRLS:tSEVCABLEVVGNGAFRLS;
implementation
begin

     _EQ_SEVCABLEVVGNGAFRLS.initnul;

     _EQ_SEVCABLEVVGNGAFRLS.Category:=_kables;
     _EQ_SEVCABLEVVGNGAFRLS.Group:=_cables;
     _EQ_SEVCABLEVVGNGAFRLS.EdIzm:=_m;
     _EQ_SEVCABLEVVGNGAFRLS.ID:='SEVCABLEVVGngAFRLS';
     _EQ_SEVCABLEVVGNGAFRLS.Standard:='ТУ16.К71-337-2004 ТУ3533-062-05755714-2011';
     _EQ_SEVCABLEVVGNGAFRLS.OKP:='35 3371 9900';
     _EQ_SEVCABLEVVGNGAFRLS.Manufacturer:='ОАО "СЕВКАБЕЛЬ-ХОЛДИНГ" г.Санкт-Петербург';
     _EQ_SEVCABLEVVGNGAFRLS.Description:='Кабель ВВГнг(А)FRLS предназначается для передачи и распределения электроэнергии в стационарных установках на номинальное переменное напряжение до 1кВ частотой 50 Гц. Кабели изготавливаются для общепромышленного применения и на атомных электростанциях (АС) вне гермозоны в системах АС класса 2 по классификации ОПБ 88/97 (ПНАЭГ-01-011) при поставках на внутренний рынок и на экспорт, в том числе в страны с тропическим климатом. Климатическое исполнение В, категория размещения 1-5 по ГОСТ15150-69.Кабели соответствуют стандарту ГОСТ31996-2012. Индекс FR в марках кабелей означает огнестойкость. Индекс LS в марках означает низкое дымо и газовыделение. Кабель предназначен для прокладки в кабельных сооружениях и помещениях, в т. ч. во взрывоопасных зонах всех классов, кроме взрывоопасных зон класса В-1. Класс пожарной опасности П1б.1.2.2.2';
     _EQ_SEVCABLEVVGNGAFRLS.NameShortTemplate:='ВВГнг(А)FRLS-%%[Wire_Count_Section_DESC]';
     _EQ_SEVCABLEVVGNGAFRLS.NameTemplate:='Кабель силовой ВВГнг(А)FRLS-%%[Wire_Count_Section_DESC]';
     _EQ_SEVCABLEVVGNGAFRLS.UIDTemplate:='%%[ID]-%%[Wire_Count_Section_DESC]';
     _EQ_SEVCABLEVVGNGAFRLS.NameFullTemplate:='Кабель силовой  с медными жилами, с термическим барьером из слюдосодержащих лент, с изоляцией и оболочкой из ПВХ пластика пониженной пожарной опасности, сечением %%[Wire_Count_Section_DESC]';

     _EQ_SEVCABLEVVGNGAFRLS.Wire_Count_Section_DESC:=_01_1_50;

     _EQ_SEVCABLEVVGNGAFRLS.TreeCoord:='BP_СЕВКАБЕЛЬ-ХОЛДИНГ_Силовые_ВВГнг(А)FRLS|BC_Кабельная продукция_Силовые_ВВГнг(А)FRLS(СЕВКАБЕЛЬ)';

     _EQ_SEVCABLEVVGNGAFRLS.format;

end.