subunit devicebase;
interface
uses system;
var
   _EQ_OWEN_PVT110H4A:DbBaseObject;
implementation
begin
   _EQ_OWEN_PVT110H4A.initnul;
   _EQ_OWEN_PVT110H4A.Group:='Датчикивлажности_аналог_';
   _EQ_OWEN_PVT110H4A.EdIzm:=_sht;
   _EQ_OWEN_PVT110H4A.ID:='OWEN_PVT110H4.A';
   _EQ_OWEN_PVT110H4A.Standard:='ТУ 26.51.51-003-46526536-2021';
   _EQ_OWEN_PVT110H4A.OKP:='';
   _EQ_OWEN_PVT110H4A.Manufacturer:='"ОВЕН" г.Москва';
   _EQ_OWEN_PVT110H4A.Description:='Промышленный датчик влажности и температуры ОВЕН ПВТ110 предназначен для непрерывного измерения относительной влажности (ОВ) и температуры воздуха или неагрессивного газа и преобразования измеренных значений в зависимости от модели прибора в: Унифицированные выходные сигналы 4…20 мА или 0…10 В или в цифровой сигнал по протоколу Modbus (RTU) через интерфейс RS-485.';
   _EQ_OWEN_PVT110H4A.NameShort:='ПВТ110-H4.A';
   _EQ_OWEN_PVT110H4A.Name:='Датчик влажности и температуры ПВТ110-H4.A';
   _EQ_OWEN_PVT110H4A.NameFull:='Промышленный датчик влажности и температуры, крепление на стену, встроенный зонд, диапазон измерения влажность: 5…95(0…100)%, температура: -40…+80%%D, выходной сигнал 4-20мА, IP65';
   _EQ_OWEN_PVT110H4A.TreeCoord:='BP_ОВЕН_Датчики влажгности_ПВТ110-H4.A|BC_Оборудование автоматизации_Датчики влажгности_ПВТ110-H4.A';
   _EQ_OWEN_PVT110H4A.format;
end.