subunit devicebase;
interface
uses system;
type
     TIvanCabMKEKSWngALS_WCS=(_01_02_35(*'1x2х0.35'*),
                              _01_02_50(*'1x2х0.5'*),
                              _01_02_75(*'1x2х0.75'*),
                              _01_02_10(*'1x2х1.0'*),
                              _01_02_15(*'1x2х1.5'*),
                              _01_02_25(*'1x2х2.5'*),
_02_02_35(*'2x2х0.35'*),
                              _02_02_50(*'2x2х0.5'*),
                              _02_02_75(*'2x2х0.75'*),
                              _02_02_10(*'2x2х1.0'*),
                              _02_02_15(*'2x2х1.5'*),
                              _02_02_25(*'2x2х2.5'*),
_03_02_35(*'3x2х0.35'*),
                              _03_02_50(*'3x2х0.5'*),
                              _03_02_75(*'3x2х0.75'*),
                              _03_02_10(*'3x2х1.0'*),
                              _03_02_15(*'3x2х1.5'*),
                              _03_02_25(*'3x2х2.5'*),
_04_02_35(*'4x2х0.35'*),
                              _04_02_50(*'4x2х0.5'*),
                              _04_02_75(*'4x2х0.75'*),
                              _04_02_10(*'4x2х1.0'*),
                              _04_02_15(*'4x2х1.5'*),
                              _04_02_25(*'4x2х2.5'*),
_05_02_35(*'5x2х0.35'*),
                              _05_02_50(*'5x2х0.5'*),
                              _05_02_75(*'5x2х0.75'*),
                              _05_02_10(*'5x2х1.0'*),
                              _05_02_15(*'5x2х1.5'*),
                              _05_02_25(*'5x2х2.5'*),
_06_02_35(*'6x2х0.35'*),
                              _06_02_50(*'6x2х0.5'*),
                              _06_02_75(*'6x2х0.75'*),
                              _06_02_10(*'6x2х1.0'*),
                              _06_02_15(*'6x2х1.5'*),
                              _06_02_25(*'6x2х2.5'*),
_07_02_35(*'7x2х0.35'*),
                              _07_02_50(*'7x2х0.5'*),
                              _07_02_75(*'7x2х0.75'*),
                              _07_02_10(*'7x2х1.0'*),
                              _07_02_15(*'7x2х1.5'*),
                              _07_02_25(*'7x2х2.5'*),
_10_02_35(*'10x2х0.35'*),
                              _10_02_50(*'10x2х0.5'*),
                              _10_02_75(*'10x2х0.75'*),
                              _10_02_10(*'10x2х1.0'*),
                              _10_02_15(*'10x2х1.5'*),
                              _10_02_25(*'10x2х2.5'*));

    TIvanCabMKEKSWngALS=packed object(CableDeviceBaseObject)
                        Wire_Count_Section_DESC:TIvanCabMKEKSWngALS_WCS;
                  end;
var
   _EQ_IvanCabMKEKSWngALS:TIvanCabMKEKSWngALS;
implementation
begin
     _EQ_IvanCabMKEKSWngALS.initnul;

     _EQ_IvanCabMKEKSWngALS.Category:=_kables;
     _EQ_IvanCabMKEKSWngALS.Group:=_cables;
     _EQ_IvanCabMKEKSWngALS.EdIzm:=_m;
     _EQ_IvanCabMKEKSWngALS.ID:='IvanCabMKEKSWngALS';
     _EQ_IvanCabMKEKSWngALS.Standard:='ТУ 27.32.13-026-45310838-2020';
     _EQ_IvanCabMKEKSWngALS.OKP:='';
     _EQ_IvanCabMKEKSWngALS.Manufacturer:='ООО "Ивановский кабельный завод" г.Иваново';
     _EQ_IvanCabMKEKSWngALS.Description:='Кабели предназначены для присоединения к стационарным электрическим приборам, аппаратам, устройствам с номинальным переменным напряжением до 500 В переменного тока частоты до 400 Гц или постоянным напряжением до 750 В. Применяются для подключения различных устройств промышленной автоматики, датчиков, контроллеров, исполнительных механизмов и других устройств. Также монтажный кабель используют в сисемах телемеханики, прочих системах где, необходим контроль и управление отдельными элементами оборудования';

     _EQ_IvanCabMKEKSWngALS.NameShortTemplate:='МКЭКШВнг(А)-LS-%%[Wire_Count_Section_DESC]';
     _EQ_IvanCabMKEKSWngALS.NameTemplate:='Кабель монтажный бронированный МКЭКШВнг(А)-LS-%%[Wire_Count_Section_DESC]';
     _EQ_IvanCabMKEKSWngALS.UIDTemplate:='%%[ID]-%%[Wire_Count_Section_DESC]';
     _EQ_IvanCabMKEKSWngALS.NameFullTemplate:='Кабель монтажные с медными токопроводящими жилами, с изоляцией и оболочкой из поливинилхлоридного пластиката пониженной пожарной опасности, не распространяющие горение при групповой прокладке, с низким дымо- и газовыделением, низкой токсичностью продуктов горения, с проволочной плетеной броней и экраном, сечением %%[Wire_Count_Section_DESC]';

     _EQ_IvanCabMKEKSWngALS.Wire_Count_Section_DESC:=_02_75;

     _EQ_IvanCabMKEKSWngALS.TreeCoord:='BP_Ивановский кабельный завод_Кабели монтажные_МКЭКШВнг(А)-LS|BC_Кабельная продукция_монтажные_МКЭКШВнг(А)-LS(Ивановский кабельный завод)';

     _EQ_IvanCabMKEKSWngALS.format;
end.