subunit devicebase;
interface
uses system;
type
  TMETRAN_286_L=(_0060(*'60'*),
                 _0080(*'80'*),
                 _0100(*'100'*),
                 _0120(*'120'*),
                 _0160(*'160'*),
                 _0200(*'200'*),
                 _0250(*'250'*),
                 _0320(*'320'*),
                 _0400(*'400'*),
                 _0500(*'500'*),
                 _0630(*'630'*),
                 _0800(*'800'*),
                 _1000(*'1000'*),
                 _1250(*'1250'*),
                 _1600(*'1600'*),
                 _2000(*'2000'*),
                 _2500(*'2500'*),
                 _3150(*'3150'*));
  TMETRAN_286=packed object(ElDeviceBaseObject);
    L:TMETRAN_286_L;
    Diap:string;
  end;
var
  _EQ_METRAN_286:TMETRAN_286;
implementation
begin
  _EQ_METRAN_286.initnul;
  _EQ_METRAN_286.Group:=_thermosensor;
  _EQ_METRAN_286.EdIzm:=_sht;
  _EQ_METRAN_286:='METRAN_286';
  _EQ_METRAN_286.Standard:='ТУ 4211-007-12980824-2002';
  _EQ_METRAN_286.OKP:='';
  _EQ_METRAN_286.L:=_0100;
  _EQ_METRAN_286.Diap:='-50…500';
  _EQ_METRAN_286.Manufacturer:='ПГ МЕТРАН';
  _EQ_METRAN_286.Description:='Преобразователи температуры Метран-280 предназначены для точных измерений температуры. Использование ПТ допускается в нейтральных, а также агрессивных средах, по отношению к которым материал защитной арматуры является коррозионностойким.';
  _EQ_METRAN_286.NameShortTemplate:='286-33-1-%%[L]/l-H10-(%%[Diap])C-R19-У1.1';
  _EQ_METRAN_286.NameTemplate:='Преобразователи температуры Метран-286-33-1-%%[L]/l-H10-(%%[Diap])C-R19-У1.1';
  _EQ_METRAN_286.NameFullTemplate:='Преобразователь температуры, с гальванической развязкой, длина погружной части %%[L]мм, диапазон измерения %%[Diap]°C, кабельный ввод R19, выходной сигнал 4-20мА с цифровым сигналом на базе протокола HART';
  _EQ_METRAN_286.UIDTemplate:='%%[ID]-%%[Diap]';
  _EQ_METRAN_286.TreeCoord:='BP_Метран_Датчики темрературы_Метран-286-33-1|BC_Оборудование автоматизации_Датчики температуры_Метран-286-33-1(Метран)';
  _EQ_METRAN_286.format;
end.